03-raw-benchmark-runs/flowplane-connect-byteconverter-all-2min-25rps-20260613-012043/postgres/producer.out.log
Reading payloads from: /tmp/flowplane-connect-byteconverter-all-2min-25rps-20260613-012043-payloads.jsonl
Number of messages read: 50
127 records sent, 25.2 records/sec (25.04 MB/sec), 9.6 ms avg latency, 211.0 ms max latency.
126 records sent, 25.1 records/sec (24.89 MB/sec), 7.5 ms avg latency, 16.0 ms max latency.
126 records sent, 25.0 records/sec (24.81 MB/sec), 7.3 ms avg latency, 10.0 ms max latency.
125 records sent, 24.9 records/sec (24.66 MB/sec), 7.1 ms avg latency, 11.0 ms max latency.
126 records sent, 25.1 records/sec (24.92 MB/sec), 7.4 ms avg latency, 11.0 ms max latency.
126 records sent, 25.0 records/sec (24.81 MB/sec), 7.1 ms avg latency, 9.0 ms max latency.
125 records sent, 24.9 records/sec (24.65 MB/sec), 7.1 ms avg latency, 9.0 ms max latency.
126 records sent, 25.1 records/sec (24.93 MB/sec), 7.0 ms avg latency, 24.0 ms max latency.
125 records sent, 25.0 records/sec (24.77 MB/sec), 6.9 ms avg latency, 11.0 ms max latency.
125 records sent, 24.9 records/sec (24.73 MB/sec), 6.8 ms avg latency, 9.0 ms max latency.
126 records sent, 25.1 records/sec (24.88 MB/sec), 6.9 ms avg latency, 9.0 ms max latency.
125 records sent, 24.9 records/sec (24.66 MB/sec), 7.0 ms avg latency, 11.0 ms max latency.
126 records sent, 25.0 records/sec (24.81 MB/sec), 7.0 ms avg latency, 9.0 ms max latency.
126 records sent, 25.1 records/sec (24.93 MB/sec), 6.9 ms avg latency, 10.0 ms max latency.
125 records sent, 24.9 records/sec (24.70 MB/sec), 6.6 ms avg latency, 14.0 ms max latency.
126 records sent, 25.1 records/sec (24.87 MB/sec), 6.7 ms avg latency, 10.0 ms max latency.
126 records sent, 25.1 records/sec (24.85 MB/sec), 6.8 ms avg latency, 11.0 ms max latency.
125 records sent, 24.9 records/sec (24.66 MB/sec), 6.9 ms avg latency, 12.0 ms max latency.
126 records sent, 25.1 records/sec (24.86 MB/sec), 7.0 ms avg latency, 10.0 ms max latency.
125 records sent, 24.9 records/sec (24.72 MB/sec), 6.7 ms avg latency, 10.0 ms max latency.
126 records sent, 25.1 records/sec (24.92 MB/sec), 6.6 ms avg latency, 9.0 ms max latency.
125 records sent, 24.9 records/sec (24.74 MB/sec), 6.7 ms avg latency, 13.0 ms max latency.
125 records sent, 25.0 records/sec (24.75 MB/sec), 6.8 ms avg latency, 10.0 ms max latency.
3000 records sent, 24.998750 records/sec (24.79 MB/sec), 7.06 ms avg latency, 211.00 ms max latency, 7 ms 50th, 8 ms 95th, 10 ms 99th, 23 ms 99.9th.